#include <iostream>
using namespace std;

//列挙型Weekの宣言
// enum Location{TOKYO, OSAKA, KYOTO, MORIOKA, SHIZUOKA, HIROSHIMA, UTUNOMIYA};

int main() {
  int l; //switch
  int s;
  int i; //for
  int t = 5; 
  int r;
  int q;
  int p;  

  // l = TOKYO;

  cout << "新幹線チケット予約サイトです\n" ;
  cout << "行き先を下記の中から選び入力してください\n" ;
  cout << "１東京、２大阪、３京都、４盛岡、５静岡、６広島、７宇都宮\n" ;
  cin >> l;
  cout << "座席の種類を入力してください\n" ;
  cout << "１指定席、２グリーン、３自由席\n" ;
  cin >> s;
  
  // 値より異なる出力を行う
  switch (l) {
  case 1:
    if (s == 1) {
      cout << "東京　指定席　１１,４１０円です\n" ;
    }
    if (s == 2) {
      cout << "東京　グリーン　１４,８７０円です\n" ;
    }
    if (s == 3) {
      cout << "東京　自由席　１０,５６０円です\n" ;
    }
    break;
    
  case 2:
    if (s == 1) {
      cout << "大阪　指定席　１７,４２０円です\n" ;
    }
    if (s == 2) {
      cout << "大阪　グリーン　２５,５５０円です\n" ;
    }
    if (s == 3) {
      cout << "大阪　自由席　１６,３７０円です\n" ;
    }
    break;
    
  case 3:
    if (s == 1) {
      cout << "京都　指定席　１７,４２０円です\n" ;
    }
    if (s == 2) {
      cout << "京都　グリーン　２５,５５０円です\n" ;
    }
    if (s == 3) {
      cout << "京都　自由席　１６,３７０円です\n" ;
    }
    break;
    
  case 4:
    if (s == 1) {
      cout << "盛岡　指定席　６,５８０円です\n" ;
    }
    if (s == 2) {
      cout << "盛岡　グリーン　８,６５０円です\n" ;
    }
    if (s == 3) {
      cout << "盛岡　自由席　６,５０円です\n" ;
    }
    break;
    
  case 5:
    if (s == 1) {
      cout << "静岡　指定席　１４,６７０円です\n" ;
    }
    if (s == 2) {
      cout << "静岡　グリーン　２０,２００円です\n" ;
    }
    if (s == 3) {
      cout << "静岡　自由席　１３,０９０円です\n" ;
    }
      break;
  case 6:
    if (s == 1) {
      cout << "広島　指定席　１９,１７０円です\n" ;
    }
    if (s == 2) {
      cout << "広島　グリーン　２９,６９０円です\n" ;
    }
    if (s == 3) {
      cout << "広島　自由席　１７，０６０円です\n" ;
    }
      break;
  case 7:
    if (s == 1) {
      cout << "宇都宮　指定席　８,５７０円です\n" ;
    }
    if (s == 2) {
      cout << "宇都宮　グリーン　１２,０３０円です\n" ;
    }
    if (s == 3) {
      cout << "宇都宮　自由席　８,０４０円です\n" ;
    }
      break;
  }
  cout << "発車時刻は\n";
  for(i=0; i<17; i++){
    t += 1;
    cout << t << ":00\n";
    if(t == 22){
      cout << "です。\n";
    }
  }
  cout << "乗車時刻を入力してください\n";
  cin >> r;
  if(r >= 6 && r <=22){
    switch(l){
      case 1:
        cout << "東京行き" << r << "::00発" << r +1 << ":30着\n" ;
        if (s == 1) {
          cout << "指定席　１１,４１０円\n" ;
        }
        if (s == 2) {
          cout << "グリーン　１４,８７０円\n" ;
        }
        if (s == 3) {
          cout << "自由席　１０,５６０円\n" ;
        }
          break;
      
      case 2:
        cout << "大阪行き" << r << ":00発"<< r+4 << ":22着\n" ;
        if (s == 1) {
          cout << "指定席　１７,４２０円\n" ;
        }
        if (s == 2) {
          cout << "グリーン　２５,５５０円\n" ;
        }
        if (s == 3) {
          cout << "自由席　１６,３７０円\n" ;
        }
          break;
      
      case 3:
        cout << "京都行き" << r << ":00発"<< r+3 << ":50着\n" ;
        if (s == 1) {
          cout << "指定席　１７,４２０円\n" ;
        }
        if (s == 2) {
          cout << "グリーン　２５,５５０円\n" ;
        }
        if (s == 3) {
          cout << "自由席　１６,３７０円\n" ;
        }
          break;
      case 4:
        cout << "盛岡行き" << r << ":00発"<< r << ":40着\n";
        if (s == 1) {
          cout << "指定席　６,５８０円\n";
        }
        if (s == 2) {
          cout << "グリーン　８,６５０円\n";
        }
        if (s == 3) {
          cout << "自由席　６,５０円\n";
        }
          break;
      case 5:
        cout << "静岡行き" << r << ":00発"<< r+2 << ":50着\n";  
        if (s == 1) {
          cout << "静岡　指定席　１４,６７０円です\n";
        }
        if (s == 2) {
          cout << "静岡　グリーン　２０,２００円です\n";
        }
        if (s == 3) {
          cout << "静岡　自由席　１３,０９０円です\n";
        }
            break;
      case 6:
        if(r <= 13){
          cout << "広島行き" << r << ":00発"<< r+10 << ":50着\n";
          }
        if(r >=14){
          cout << "広島行き" << r << ":00発"<< r+10-24 << ":50着\n";
        }
        if (s == 1) {
          cout << "指定席　１９,１７０円\n" ;
        }
        if (s == 2) {
          cout << "グリーン　２９,６９０\n" ;
        }
        if (s == 3) {
          cout << "自由席　１７，０６０円\n";
        }
          break;
      case 7:
        cout << "宇都宮行き" << r << ":00発"<< r+1 << ":08着" ;
        if (s == 1) {
          cout << "宇都宮　指定席　８,５７０円です" ;
        }
        if (s == 2) {
          cout << "宇都宮　グリーン　１２,０３０円です" ;
        }
        if (s == 3) {
          cout << "宇都宮　自由席　８,０４０円です" ;
        }
          break;
  }
    cout << "以上でお間違えありませんか？\n";
    cout << "１はい　２いいえ\n";
    cin >> q;
    if(q == 1){
      cout << "お支払方法をお選びください\n";
      cout << "１クレジットカード　２コンビニ（現金のみ）　３金融機関（ATM）\n";
      cin >> p;
      cout << "予約が完了しました。\n";
      cout << "ご利用ありがとうございました。\n";
    }else if(q == 2){
      cout << "お手数をおかけしますが最初からやり直してください。\n";
    }
  }else
    cout << "時間入力エラー\nお手数をおかけしますが最初からやり直してください。";
    //cout << "お手数をおかけしますが最初からやり直してください。\n";
}